app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."title" = 'Welcome' LIMIT 1
---
  def index
    @pages = Page.all.sort{ |a,b| a[:title] <=> b[:title]}

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO "pages" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "this is some info for macerating\r\n"], ["created_at", Sat, 02 Mar 2013 20:44:20 UTC +00:00], ["title", "Marketing"], ["updated_at", Sat, 02 Mar 2013 20:44:20 UTC +00:00]]
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pages" SET "content" = 'Welcome to the Bixby Apps Internal Knowledge Exchange or BIKE for short. This is where we share internal information for employees such as processes, marketing copy, or anything worth sharing.
---
  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])